index.html
<!doctype html>
<html lang="en">
<head>
<title>Coventry University CSM Journal Reading Club</title>
<!-- 2025-07-01 Tue 22:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="James Brusey">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Introduction</a>
<ul class="nav">
<li><a href="#sec-">When</a></li>
<li><a href="#sec-">What club members will need to do beforehand</a></li>
<li><a href="#sec-">How we will choose papers</a></li>
<li><a href="#sec-">Rough agenda</a></li>
<li><a href="#sec-">Who can join?</a></li>
</ul>
</li>
<li><a href="#sec-">2025</a>
<ul class="nav">
<li><a href="#sec-">June</a></li>
<li><a href="#sec-">April</a></li>
<li><a href="#sec-">February</a></li>
<li><a href="#sec-">January</a></li>
</ul>
</li>
<li><a href="#sec-">2024</a>
<ul class="nav">
<li><a href="#sec-">June</a></li>
<li><a href="#sec-">February</a></li>
<li><a href="#sec-">January</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Coventry University CSM Journal Reading Club</h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Introduction</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">When</h3>
<div class="outline-text-3" id="text-">
<p>
Wednesday mornings 10am - 11am starting from 7th September 2023.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">What club members will need to do beforehand</h3>
<div class="outline-text-3" id="text-">
<p>
Read the paper (even if only a skim read) and come ready to discuss, explain, and tell us what you found difficult to understand.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">How we will choose papers</h3>
<div class="outline-text-3" id="text-">
<p>
We'll start with some classic papers in the domain of Reinforcement Learning but we can branch out any time and club members will get to propose and vote on their preferred papers (perhaps using Padlet).
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Rough agenda</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li>Challenge to each attendee - prove you read something of the paper (e.g., by telling us about one aspect of the work).
</li>
<li>Ask for help - what was hard to understand?
</li>
<li>Suggestions and votes for the next paper to review.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Who can join?</h3>
<div class="outline-text-3" id="text-">
<p>
All PGRs are invited but staff are welcome too.
We also invite members of NUST from our joint lab on Human Robotics Interaction (NC-HRI).
James will initially lead the sessions but that can change as we go forward.
</p>
</div>
</div>
</div>




<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">2025</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">June</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=BCiZc0n6COY&amp;list=PLruBu5BI5n4aFpG32iMbdWoRVAA-Vcso6">Youtube: David Mackay's Information Theory, Pattern Recognition, and Neural Networks</a>
</li>

<li><a href="https://www.inference.org.uk/itprnn/book.pdf">David Mackay's book</a>
</li>

<li><a href="http://GitHub.coventry.ac.uk/pages/aa3172/presentations/2025-06-mackay/ch2.html">Slides on Mackay chapter 2</a>
</li>

<li><a href="https://www.youtube.com/watch?v=GDJFLfmyb20">Explanation of Jensen's Inequality</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">April</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://www.anthropic.com/research/tracing-thoughts-language-model">Tracing the thoughts of a large language model</a>
</li>
<li><a href="https://arxiv.org/abs/2006.11239">Denoising Diffusion Probabilistic Models</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">February</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://www.nature.com/articles/nature16961">Mastering the game of Go with deep neural networks and tree search</a>
</li>

<li><a href="https://arxiv.org/abs/2411.04872">FrontierMath: A Benchmark for Evaluating Advanced Mathematical Reasoning in AI</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">January</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://arxiv.org/abs/2501.12948">DeepSeek-R1: Incentivizing Reasoning Capability in LLMs via Reinforcement Learning</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">2024</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">June</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://arxiv.org/pdf/2406.02528">Scalable MatMul‑free Language Modeling</a> — Zhou et al.; <b>arXiv</b> v5 18 Jun 2024 
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">February</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://arxiv.org/pdf/2202.05607.pdf">Online Decision Transformer</a> — Zheng, Zhang &amp; Grover; <b>CoRR</b> Feb 2022 
</li>
<li><a href="https://proceedings.neurips.cc/paper_files/paper/2017/file/3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf">Neural Architecture Search with Reinforcement Learning</a> — Zoph &amp; Le; <b>ICLR/NeurIPS</b> 2017 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">January</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li><a href="https://arxiv.org/pdf/2005.05719.pdf">Smooth Exploration for Robotic Reinforcement Learning</a> — Raffin, Kober &amp; Stulp; <b>CoRL</b> 2022 (PMLR) 
</li>
<li><a href="https://arxiv.org/pdf/2305.18290.pdf">Direct Preference Optimization: Your Language Model is Secretly a Reward Model</a> — Rafailov et al.; <b>arXiv</b> May 2023; NeurIPS 2023 poster 
</li>
<li><a href="https://www.nature.com/articles/s41586-023-06924-6">Mathematical discoveries from program search with large language models</a> — Romera‑Paredes et al.; <b>Nature</b> Jan 2024 
</li>
</ul>
</div>
</div>
</div>
</div></div></div>
</body>
</html>
